stressTest.yml
config:
  target: 'http://ec2-34-212-119-129.us-west-2.compute.amazonaws.com:3001'
  phases:
    - duration: 10
      arrivalRate: 300
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
      - get:
          url: '/api/product'
          capture:
            # capturing responce using reg expression
            - regexp: '[^]*'
              as: 'response'
      # - log: 'response= {{response}}'